[
    {
        "author": "Franz_Werfel",
        "statement": "the famers protests on the continent were about fuel prices and subsidies, now they've tacked on some nebulous complaints about EU regulation, without saying specifically which ones.\n\ni will also say that it requires a massive amount of cognitive dissonance for irish famers to protest against EU ag-policy.."
    },
    {
        "author": "lamahorses",
        "statement": "Over 30% of the European budget is on CAP etc"
    },
    {
        "author": "ConnolysMoustache",
        "statement": "What are they even protesting?\n\nThe IFA representative on prime time couldn’t even say when asked what specifically they were upset with, just that they want recognition(?). He clearly didn’t know why they were even protesting beyond a general hate of regulations and wanting “recognition” as he put it. \n\nDid the lads just want to do an unplanned tractor run.\n\nYou can’t get free money from the EU without any regulations. The arrogance of some farmers is unreal. If you don’t like the regulations, don’t take the money, if you like the money, uphold your side of the deal and implement the regulations.\n\nI wish that farmers weren’t such a powerful voting block in this country, would love to see politicians call this shit out."
    },
    {
        "author": "bintags",
        "statement": "These people are brainwashed. "
    },
    {
        "author": "gofuckyoureself21",
        "statement": "Stop bitching at each other and get out and support the farmers, literally the backbone of the country."
    },
    {
        "author": "No-Category-38",
        "statement": "People with jobs are too busy for this shit."
    },
    {
        "author": "af_lt274",
        "statement": ">massive amount of cognitive dissonance for irish famers to protest against EU ag-policy..\n\nDecades of production caps would say otherwise. Farmers want to produce food, not be recipients of single farm payments."
    },
    {
        "author": "DiscussionUnusual466",
        "statement": "Well now , just to break in down quickly for you , EU wants to lower our carbon footprint so it's targeting farming by reducing subsidies ,  things like fuel, grain and feed for cows etc. This drives up cost for the farmers and thus pushes up their prices , this makes them uncompetitive in the global market as most farms and coops goods gets sold as future contracts and they end up losing out . The farms become unsustainable and have to eventually be sold , big corporations and billionaires like bill gates buy them as land banks for a reduced rate. Eventually our food production will be like manufacturing and offshored to cheaper countries with lower standards in environment but the EU can claim they lowered our emotions even though our populations and consumption go up to support the Ponzi scheme and their pensions.\n\n\nSource \n\n\n\n\nhttps://www.linkedin.com/pulse/futures-options-contract-explained-farming-logic-gaurav-kumar\n\n\n\nhttps://theguardian.com/commentisfree/2021/apr/05/bill-gates-climate-crisis-farmland\n\n\n\nhttps://www.consilium.europa.eu/en/60-years-of-common-agricultural-policy/"
    },
    {
        "author": "TruthSeeker101110",
        "statement": "Don't they already get [€1.2 billion in subsidies per year](https://www.teagasc.ie/publications/2020/cap-provides-important-funds-for-irish-farms.php), that's enough to give every person in Ireland over €300. Also didn't they get the [€1.5 billion agri-environmental scheme called ACRES](https://cullennurseries.ie/acres-scheme/#:~:text=The%20ACRES%20scheme%2C%20integral%20to,water%20quality%20on%20their%20farms) and also the [€9.8  billion in grants](https://www.irishtimes.com/business/farming-food/2022/10/04/cabinet-to-consider-latest-round-of-cap-scheme-worth-10bn-to-irish-agriculture/#:~:text=Irish%20farmers%20are%20to%20receive,by%20the%20Cabinet%20on%20Tuesday). The Irish countryside must be full of crops."
    },
    {
        "author": "bintags",
        "statement": "The cognitive dissonance is all that’s keeping them going. They’re like religious people. "
    },
    {
        "author": "Healthy-Travel3105",
        "statement": "I thought their issue was having to compete with imported products that don't have to follow the same regulations?"
    },
    {
        "author": "JRR_STARK",
        "statement": "Alright, you know more about agriculture then the farmers"
    },
    {
        "author": "Franz_Werfel",
        "statement": "What are they protesting about?"
    },
    {
        "author": "Conscious_Accident85",
        "statement": "What came before them regulations though was a lot lot worse. There were lands being massively overgrazed and destroyed because with how the subsidies were set up based on herd size more so than land you could have 1000 sheep on a field that could only feed 100. \n\nIn the long term them policies were disastrous."
    },
    {
        "author": "Conscious_Accident85",
        "statement": "Irelands manufacturing sector is the largest in the world relative to population and is growing fast. It’s on pace the overtake the UKs in total size within 5 years. We benefited from US companies outsourcing and setting up plants here not the other way around. We’ve benefited from the EU on this front as well.\n\nVery few if any farms in Ireland are owned by big corporations or bill gates. The main issue in Irish farming is the cartel running the factories and slaughterhouses. We are one of biggest recipients of EU grants. Farming in Ireland has massively benefited from the eu."
    },
    {
        "author": "Deleted",
        "statement": "If the farmers can't keep their business's going without subsidies, then they deserve to be put out of business.\n\nThis didn't come out of nowhere, they've had about 20 years of warning to prepare and diversify their farms, as plenty have, and those who refuse to adapt are sadly going to go bankrupt and lose their farms. \n\n>The farms become unsustainable and have to eventually be sold , big corporations and billionaires like bill gates buy them as land banks for a reduced rate. \n\nThese stubborn farmers will be able to choose who to sell their land to, they'd have loads of other options, but yes, you're correct, they probably will sell them to the highest bidder, no matter what plans the buyer has, because it never really was about \"love of the land\" for those farmers anyway."
    },
    {
        "author": "DiscussionUnusual466",
        "statement": "They receive the subsidiary to keep the price that you pay low ...so another way of thinking is why do you pay so little for your food , look at other under developed nations where food will cost you most of your salary because it's not subsidised "
    },
    {
        "author": "RoyRobotoRobot",
        "statement": "There is a good bit of mismanagement of funds at Government level. DAFM has a lot to answer for. But that could be said about the whole Government."
    },
    {
        "author": "DiscussionUnusual466",
        "statement": "The only cognitive dissonance  going on here is that you don't understand that you are the end beneficiary of the subsidies by not paying market rate for your food ...all the raw materials for everything you eat and drink is dependent on subsidies , take them away and watch those prices climb , farmers will always have a full plate and be able to feed themselves , you however ...I doubt you could keep a house plant alive for longer then a month "
    },
    {
        "author": "ConnolysMoustache",
        "statement": "If it is the IFA guy on prime time neglected to say that. They need a new media guy.\n\n\nAlso if that’s their issue, those imports don’t get flushed with EU money. 30% of the EU budget goes towards CAP.\n\nIt’s really very simply. The EU isn’t a magic money tree. If you want / get their money you have to comply with regulations.\n\nThose imports don’t get EU money so don’t have the same regulations. I presume it’s Argentine beef we’re talking about."
    },
    {
        "author": "DiscussionUnusual466",
        "statement": "Your food prices going up "
    },
    {
        "author": "DiscussionUnusual466",
        "statement": "To date that is true that farms have benefited , but that is changing , most farmers or mortgaged up to the eyes because believe it or not harvesters and other equipment cost a eye watering amount , most people think farmers have a tone of money because of land vale but in truth its all owned in debt and most are just keeping their heads above water because of the subsidies "
    },
    {
        "author": "RoyRobotoRobot",
        "statement": "You do know we subsidize farmers to keep food prices down? You seem to have a very poor understanding of how the agricultural industry works and if you ever dealt with the grant schemes you would realize that DAFM is ran about aswell as RTÉ."
    },
    {
        "author": "BB2014Mods",
        "statement": "> If the farmers can't keep their business's going without subsidies, then they deserve to be put out of business.\n\nYou are a total fucking moron, like this has got to be the absolute shittiest take I have ever seen on Reddit"
    },
    {
        "author": "DiscussionUnusual466",
        "statement": "ok smooth brain, look at what happened when the war in the Ukraine started, and grain prices went up ? Feed for cattle when up , so price of milk , cheese beef went up all , same for flour and the beer , all the ingredients need for a burger and beer, and you have seen the cost of living go up with that ... the reason for the subsidies is to lower the cost of food for us, the consumers. \n\nIf you want 10 quid pints of milk without subsidies, then the same logic should be applied to everything including social housing, which believe it or not is used to lower the cost of labor,  it lowers the need to pay a fair wage because housing is artificially blow what the market would pay. In the same way if you were to pay the fair price for any ingredient off a farm you would be paying much higher prices as farmers would not take the risk of overproducing which is why we subsidies in the first place....."
    },
    {
        "author": "lkdubdub",
        "statement": "But Bill Gates!"
    },
    {
        "author": "TruthSeeker101110",
        "statement": "You sure? i thought Ireland was [a net exporter](https://www.enterprise-ireland.com/en/supports/become-more-innovative/technology-centres/mti#:~:text=Ireland%20is%20the%20biggest%20net,of%20MTI's%20Phase%20II%20programme). Maybe it keeps the EU's food lower. Not sure about domestically."
    },
    {
        "author": "bintags",
        "statement": "I disagree, farmers are thick "
    },
    {
        "author": "showars",
        "statement": "Begs the question of why we would consciously sell food that doesn’t adhere to EU regulations? Are the regulations not necessary for the quality of the food in the EU? \n\nI understand that you have to follow them to get the money but can’t figure out why"
    },
    {
        "author": "Franz_Werfel",
        "statement": "And who is contributing to rising food prices?"
    },
    {
        "author": "Conscious_Accident85",
        "statement": "If you make a bad decision with your finances around debt that’s not the governments fault.  Most farmers also did not buy the land they own. If they did they are doing very very well far more often than not.\n\nTractor’s and machinery is getting more expensive but the protests will not effect that in anyway and aren’t about that.\n\nIt’s not changing. In joining the EU in the first place the government a large part of it was government were willing to kill the fishing industry to help the farmers. Farmers benefit massively from the EU arguably more than anyone else. As you say yourself they are keeping there heads above water because of the EU and their funding."
    },
    {
        "author": "WolfOfWexford",
        "statement": "I’m a farmer and I massively disagree with BISS. We know the majority of the price you pay for beef is going into the supermarkets pockets, not the farmers. Get rid of the subsidies and nationalise the meat factories with the idea of selling them off to cooperatives owned by farmers. \n\nWe need the consumer product, sliced and packaged meat, to be produced by the farmers, not the middleman.\n\nIf you took the subsidies away from the dairy industry, the farmer would still turn a profit.\n\nI’m from a tillage farm, we make 2k/ha net before subsidies. When we were selling to a grain merchant it was closer to 200/ha"
    },
    {
        "author": "DiscussionUnusual466",
        "statement": "He was just a high profile example for the small brained people here \n\n\nhttps://www.irishtimes.com/business/2023/07/24/row-re-erupts-over-plans-to-develop-40m-co-kildare-land-bank-court-hears/\n\n\n\nhttps://www.eu-startups.com/2023/10/munich-based-the-landbanking-group-bags-e10-5-million-to-launch-an-investment-platform-for-natural-capital/\n\n\nhttps://www.telegraph.co.uk/world-news/2023/05/02/eu-approves-controversial-dutch-farm-buy-out-plan/\n\n\n\nhttps://theguardian.com/money/2009/nov/07/landbanking-investment-scheme"
    },
    {
        "author": "DiscussionUnusual466",
        "statement": "Ok let's do a little basic thoughts experiment \n\n\nFarmer A receives subsides to cover the cost of running the business and can lower his prices so milk only cost you 2 euro \n\n\nFarmer b doesn't receive the subsidies and has to factor in the cost so the milk cost you 4 euro \n\n\nDoes that help you understand ?"
    },
    {
        "author": "ConnolysMoustache",
        "statement": "Most of the regulations that we’re talking about are climate related, not safety related, imported food still needs to pass safety standards but its production doesn’t need to pass the same climate sustainability tests and regulations. \n\nIf you get money from the EU for the sole purpose of implementing sustainable farming, you can’t just take the money and whinge that you have to uphold your side of the argument and implement sustainable farming. That’s what they’re whining about.\n\nThe EU is not a magic money tree. You have to uphold your side of the deal."
    },
    {
        "author": "DiscussionUnusual466",
        "statement": "Increase in prices of fuel, fertilizer and grain , subsidies have not matched the increase so the cost has been passed on to us the consumers "
    },
    {
        "author": "DiscussionUnusual466",
        "statement": "Nationalise the meet factories is the same as subsidies just a different way of filling the hole in the accounts further up the line ..."
    },
    {
        "author": "TruthSeeker101110",
        "statement": "Sure if the farmer actually produces anything, which most don't.\n\nIn 2018 the average subsidy payments made up 74% of the a farms income of the average farm. For cattle and sheep farms, the payments were up to 158% of income. Anything over 100% means we are paying them more than what they are producing.\n\n[Source](https://www.teagasc.ie/publications/2020/cap-provides-important-funds-for-irish-farms.php#:~:text=In%202018%20the%20average%20subsidy,payment%20received%20was%20spent%20farming)"
    },
    {
        "author": "showars",
        "statement": "Then it’s even more stupid. Climate regulations on short travel distance for food but nothing to bring it the whole way around the world where it was likely farmed less sustainably? \n\nIt reeks of just trying to hit arbitrary targets while actually increasing climate damage"
    },
    {
        "author": "Deleted",
        "statement": "It isn’t. It disciplines capital. Rather than all that money going to Supermarket owners and their shareholders, it would create a wealth distribution effect in rural Ireland."
    },
    {
        "author": "ConnolysMoustache",
        "statement": "Arbitrary targets? There’s nothing arbitrary about concrete targets for re wetting, re forrestation of our island, keeping emissions low and toxic run off out of our water ways\n\nWe can and should be better than those countries that take massive shits on their local environment.\n\nNo money is for nothing. If you’re a farmer and you don’t like these regulations, **don’t take the EU money** it’s that simple.\n\nIf you’re a farmer that’s taking EU money and you’re whining about regulations you need to shut up. No money is for nothing, the EU isn’t winning streak."
    },
    {
        "author": "WolfOfWexford",
        "statement": "Exactly. The best we could have is local small producers. Farm to fork"
    },
    {
        "author": "showars",
        "statement": "You’re absolutely right, we can and should be better than them. So why still import their produce? If we care so much about the planet surely we should be doing something there too? Sanctions, trade restrictions, “green” taxes etc\n\n“If it’s not a problem here and it’s not our problem” doesn’t work with climate change."
    },
    {
        "author": "ConnolysMoustache",
        "statement": "We’re never not going to import foreign produce, that’s how the modern economy works now so we have two options.\n\n\n1 continue importing foreign produce because we have to and ensure that our locally produced produce isn’t literally poisoning our country, while giving farmers money to compensate them \n\nOr\n\n2 continue importing foreign produce because we have to and not regulate our local produce, poisoning our local environment.\n\nIt’s a pretty easy answer in my opinion."
    },
    {
        "author": "showars",
        "statement": "Why are they the two options? I’ve literally given you three options in the comment before. \n\nWe absolutely can tax the fuck out of produce that is damaging it’s local ecosystems, and by extension our planet, while still giving our own farmers money to compensate them. We could reduce the cost of locally sourced foods using the tax on food imported from places that do not adhere to certain standards. \n\nWe already do it for food safety so the fact that your only options are keep things as they are, which is subjectively not working, or do nothing is mad. The idea that we can only have extremes as you’ve suggested is ridiculous"
    }
]